In [2]:
import pandas as pd
import numpy as np

In [3]:
dict1={'Names':['Aravind','Samar',np.nan,'siri'],
       'Age':[np.nan,21,32,43],
       'city':['Hyd','Blr','chennai',np.nan]}
dict1

{'Names': ['Aravind', 'Samar', nan, 'siri'],
 'Age': [nan, 21, 32, 43],
 'city': ['Hyd', 'Blr', 'chennai', nan]}

In [5]:
d1=pd.DataFrame(dict1)

In [6]:
d1.dtypes

Names     object
Age      float64
city      object
dtype: object

In [7]:
dict2={'Names':['Aravind','Samar',None,'siri'],
       'Age':[None,21,32,43],
       'city':['Hyd','Blr','chennai',None]}
dict2

{'Names': ['Aravind', 'Samar', None, 'siri'],
 'Age': [None, 21, 32, 43],
 'city': ['Hyd', 'Blr', 'chennai', None]}

In [12]:
d2=pd.DataFrame(dict2)

In [13]:
d2.dtypes

Names     object
Age      float64
city      object
dtype: object

In [10]:
d1.isnull()

   Names    Age   city
0  False   True  False
1  False  False  False
2   True  False  False
3  False  False   True

In [11]:
d1.isnull().sum()

Names    1
Age      1
city     1
dtype: int64

- Generally data has some empty rows
- it is a data problem
- if you read that kind of data you will see Null
- so you need to understand it is a data corrupted/really a null values are there

**method-1:Fill with some random values**
   - **Method name**: Fill na

In [ ]:
d1.isnull().sum()*100/

In [14]:
d1.fillna(40)

     Names   Age     city
0  Aravind  40.0      Hyd
1    Samar  21.0      Blr
2       40  32.0  chennai
3     siri  43.0       40

**Method-2:**
- we can fill the values with respect to columns also

In [15]:
d1['Age'].fillna(40)

0    40.0
1    21.0
2    32.0
3    43.0
Name: Age, dtype: float64

In [16]:
d1
# it is not updated because
# inplacce= False

     Names   Age     city
0  Aravind   NaN      Hyd
1    Samar  21.0      Blr
2      NaN  32.0  chennai
3     siri  43.0      NaN

In [18]:
d1['Age'].fillna(40,inplace=True)
d1

     Names   Age     city
0  Aravind  40.0      Hyd
1    Samar  21.0      Blr
2      NaN  32.0  chennai
3     siri  43.0      NaN

In [19]:
d1['Names'].fillna('vamshi',inplace=True)
d1

     Names   Age     city
0  Aravind  40.0      Hyd
1    Samar  21.0      Blr
2   vamshi  32.0  chennai
3     siri  43.0      NaN

**Method-3**

- bfill
- ffill
- pad
- backfill

In [25]:
dict1={'Names':['Aravind','Samar',np.nan,'siri'],
       'Age':[np.nan,21,32,43],
       'city':['Hyd','Blr','chennai',np.nan]}
d1=pd.DataFrame(dict1)
d1

     Names   Age     city
0  Aravind   NaN      Hyd
1    Samar  21.0      Blr
2      NaN  32.0  chennai
3     siri  43.0      NaN

In [26]:
d1.fillna(method='bfill',axis=1)

#column1 : names index 3 is missing values it is filled with 4th index value
#column2: age index1 is missing values it is filled with index 2 value
#column3: city index 4 is missing values it should be fill with next value
#         but we dont have next value

C:\Users\vamsh\AppData\Local\Temp\ipykernel_10968\1914124427.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method='bfill')

     Names   Age     city
0  Aravind  21.0      Hyd
1    Samar  21.0      Blr
2     siri  32.0  chennai
3     siri  43.0      NaN

In [31]:
d1.fillna(method='bfill',axis=1)
#

C:\Users\vamsh\AppData\Local\Temp\ipykernel_10968\565086523.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method='bfill',axis=1)

     Names   Age     city
0  Aravind   Hyd      Hyd
1    Samar  21.0      Blr
2     32.0  32.0  chennai
3     siri  43.0      NaN

In [27]:
dict1={'Names':['Aravind','Samar',np.nan,'siri'],
       'Age':[np.nan,21,32,43],
       'city':['Hyd','Blr','chennai',np.nan]}
d1=pd.DataFrame(dict1)
d1

     Names   Age     city
0  Aravind   NaN      Hyd
1    Samar  21.0      Blr
2      NaN  32.0  chennai
3     siri  43.0      NaN

In [28]:
d1.fillna(method='ffill')

C:\Users\vamsh\AppData\Local\Temp\ipykernel_10968\4088926743.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method='ffill')

     Names   Age     city
0  Aravind   NaN      Hyd
1    Samar  21.0      Blr
2    Samar  32.0  chennai
3     siri  43.0  chennai

In [29]:
dict1={'Names':['Aravind','Samar',np.nan,'siri'],
       'Age':[np.nan,21,32,43],
       'city':['Hyd','Blr','chennai',np.nan]}
d1=pd.DataFrame(dict1)
d1

     Names   Age     city
0  Aravind   NaN      Hyd
1    Samar  21.0      Blr
2      NaN  32.0  chennai
3     siri  43.0      NaN

In [30]:
d1.fillna(method='pad')

C:\Users\vamsh\AppData\Local\Temp\ipykernel_10968\3282249208.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method='pad')

     Names   Age     city
0  Aravind   NaN      Hyd
1    Samar  21.0      Blr
2    Samar  32.0  chennai
3     siri  43.0  chennai

- backfill and bfill  fill with next value
- pad and ffill fill with previous value
- but it will change based on axis

**Method-4:**
- mean
  - Numerical values can fill with mean value
  - but mean affect by outliers
  - if we dont have outliers it is best one
  
- median
   - numerical value can fill with median value
   - we know that median value does not affect with outliers
   - so if outliers are there we can go with median
     
- mode
  - mode is useful for categorical data

In [34]:
dict1={'Names':['Aravind','Samar',np.nan,'siri'],
       'Age':[np.nan,21,32,43],
       'city':['Hyd','Blr','chennai',np.nan]}
d1=pd.DataFrame(dict1)
d1

     Names   Age     city
0  Aravind   NaN      Hyd
1    Samar  21.0      Blr
2      NaN  32.0  chennai
3     siri  43.0      NaN

In [35]:
# we already know we can fill with some values based on specific column using fillna
#d1.fillna(<random_number>)
# d1 represents all the columns
age_mean=d1['Age'].mean()
d1['Age'].fillna(age_mean)

0    32.0
1    21.0
2    32.0
3    43.0
Name: Age, dtype: float64

In [36]:
dict1={'Names':['Aravind','Samar',np.nan,'siri'],
       'Age':[np.nan,21,32,43],
       'city':['Hyd','Blr','chennai',np.nan]}
d1=pd.DataFrame(dict1)
d1

     Names   Age     city
0  Aravind   NaN      Hyd
1    Samar  21.0      Blr
2      NaN  32.0  chennai
3     siri  43.0      NaN

In [37]:
age_median=d1['Age'].median()
d1['Age'].fillna(age_median)

0    32.0
1    21.0
2    32.0
3    43.0
Name: Age, dtype: float64

In [38]:
dict1={'Names':['Aravind','Samar',np.nan,'siri'],
       'Age':[np.nan,21,32,43],
       'city':['Hyd','Blr','chennai',np.nan]}
d1=pd.DataFrame(dict1)
d1

     Names   Age     city
0  Aravind   NaN      Hyd
1    Samar  21.0      Blr
2      NaN  32.0  chennai
3     siri  43.0      NaN

In [40]:
d1['city'].mode()
# in this use case we are getting mode equal
# but in real time we will get clear mode value

0        Blr
1        Hyd
2    chennai
Name: city, dtype: object

**Method-6:**
**KNN Imputer**
 - KNN: K nearest neighbours
 - k is a hyper parameter means user can choose
 - it is distance metric: **euclidian distance**
 - KNN imputer will take the mean of the neighbours value
 - the neighbours value can be provided by using value=k
 - it is under sklearn package
 - under sklearn we have imputer method
 - under imputer method we have KNN Imputer
 - applicable only for numerical data

In [42]:
from sklearn.impute import KNNImputer

In [43]:
KI=KNNImputer()
KI.fit_transform(d1[['Age']])

array([[32.],
       [21.],
       [32.],
       [43.]])